Revit 2026 API

# DeleteElements Class

---

Deletes element(s) related to the failure.

SystemObject Autodesk.Revit.DBFailureResolution Autodesk.Revit.DBDeleteElements

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DeleteElements : FailureResolution
```
```vb
Public Class DeleteElements
	Inherits FailureResolution
```
```cpp
public ref class DeleteElements : public FailureResolution
```
```fsharp
type DeleteElements =
    class
        inherit FailureResolution
    end
```

The DeleteElements type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FailureResolution) |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId) | Creates an instance of the DeleteElements resolution. |
|  | Create(Document, IListElementId) |  |
|  | Create(Document, ISetElementId) |  |
|  | Dispose | (Inherited from FailureResolution) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace